/// <summary>利用者名簿文言</summary>
if (!desknets.Resource.uset) {
    desknets.Resource.uset = {};
}
$.extend(desknets.Resource.uset, {
    //------------------------------------------
    // ユーザー管理登録画面
    //------------------------------------------
    'defGroup': '代表組織',
    //------------------------------------------
    // ユーザーインポート画面
    //------------------------------------------
    'usetmsetlanglistTitle': '「使用言語」指定値',
    'usetmsettzlistTitle': '「タイムゾーン」指定値',
    //------------------------------------------
    // ダミー
    //------------------------------------------
    'dmy': ''
});
